PRAGMA foreign_keys=OFF;
BEGIN TRANSACTION;

INSERT INTO "core_teachtopic" VALUES(1,'פיזיקה','פיזיקה (מהמילה היוונית פיזיס φύσις, טבע) היא ענף במדעי הטבע החוקר את חוקי היסוד של הטבע כפי שהם באים לידי ביטוי בכל מערכת הניתנת לתצפית, בכדור הארץ ובחלל. הנושאים בהם עוסקת הפיזיקה כוללים תנועת עצמים, התנהגות החומר, חקר האנרגיה, והשפעת חוקי טבע מסוימים על רצף המרחב והזמן. מדע הפיזיקה מתפתח על ידי תצפיות וממצאים, המגובשים לכדי תאוריות וחוקים המתוארים לרוב בשפה של משוואות מתמטיות. ככל שיש יותר תצפיות ומתקבלים יותר ממצאים מביצוע של ניסויים, עשויות התאוריות הללו להתעדכן ולהשתכלל.
',NULL);
INSERT INTO "core_teachtopic" VALUES(2,'מכניקה','המכניקה הקלאסית היא אחד מענפי הפיזיקה הבסיסיים והמוקדמים ביותר, החוקר את תנועת הגופים, את הכוחות הפועלים עליהם ואת תכונותיהם הפיזיקליות, כשאלה מתקיימים במהירויות נמוכות (יחסית למהירות האור) ובסדרי גודל הגדולים, יחסית, מאלה שבהם עוסקת מכניקת הקוונטים (הדנה באובייקטים זעירים). לרוב, המונח "מכניקה" לבדו מתייחס למכניקה הקלאסית, הגם שאף תורת היחסות ומכניקת הקוונטים הן תורות מכניות העוסקות בחקר תחומים דומים, אך בסדרי גודל קיצוניים יותר ותוך שימוש בהנחות אחרות ובכלים מתמטיים מתקדמים יותר. המכניקה הקלאסית נקראת לעתים אף "מכניקה ניוטונית" על שמו של אייזק ניוטון, אשר נחשב למנסחה הראשון בצורתה המדעית המקובלת היום.',1);
INSERT INTO "core_teachtopic" VALUES(3,'תנועה מעגלית','בפיזיקה, תנועה מעגלית היא תנועה של גוף על גבי מסלול מעגלי. תנועה מעגלית נפוצה מאוד בטבע. דוגמאות למערכות המתוארות על ידי תנועה מעגלית: לוויין המקיף את כדור הארץ, מסה מסתובבת הקשורה לחוט מתוח ומטען חשמלי בשדה מגנטי.',2);
INSERT INTO "core_teachtopic" VALUES(4,'חוקי התנועה של ניוטון','חוקי התנועה של ניוטון הם שלושה חוקי פיזיקה שניסח אייזק ניוטון, ועוסקים בתנועתם של גופים. אלה הם חוקי היסוד של המכניקה הקלאסית.
ניוטון פרסם חוקים אלה לראשונה בספרו "העקרונות המתמטיים של פילוסופיית הטבע", ותוך שימוש בחשבון האינפיניטסימלי שפיתח, הוכיח תוצאות רבות העוסקות בגופים אידאליים. באמצעות חוקי התנועה שלו וחוק המשיכה האוניברסלי נתן ניוטון הסבר לחוקי קפלר על תנועתם של כוכבי לכת.
',2);

INSERT INTO "core_teachitem" VALUES(1,'מבוא לתנועה מעגלית','מבוא בסיסי לתנועה מעגלית',3);
INSERT INTO "core_teachitem" VALUES(2,'תנועה מעגלית בחלל','תנועה מעגלית ללא כוח משיכה',3);

INSERT INTO "core_videopage" VALUES(1,'D7GdUFVQzso','2013-12-14 10:58:53.996144','הטכניון - קורס 113013 - השלמות פיסיקה 1
הרצאה 21 - תנועה מעגלית
מרצה : פרופ'' מריו ליביו
פקולטה : פיסיקה
','השלמות פיסיקה 1 - הרצאה 21',1,1);
INSERT INTO "core_videopage" VALUES(2,'Te_WEj4nuYo','2013-12-14 10:59:39.350030','הסבר על תנועה מעגלית - דוד לניאדו - מכללת אפקה
השלמות פיזיקה','פיזיקה - דוד לניאדו - אפקה - תנועה מעגלית',1,1);
INSERT INTO "core_videopage" VALUES(3,'K82rEtPECe8','2013-12-14 11:00:07.664072','הקלטה של שיעור חי מתאריך 12.06.2013
מנחה - גיל קרסיק','פיזיקה מכניקה- תנועה מעגלית',1,2);
COMMIT;
